using System.Diagnostics.Metrics;
using System.Linq;
using System.Runtime.InteropServices;
using System.Runtime.Intrinsics.X86;
using System.Threading.Channels;
using static System.Runtime.InteropServices.JavaScript.JSType;

namespace Lab5
{
    public class Purple
    {
        public int[] Task1(int[,] matrix)
        {
            int[] answer = null;

            //===========================================================================================================================================================
            // В работе разрешены методы классов: Console, Math. Random, Convert, Array.

            // Не использовать больше двух уровней вложенности циклов

            // If you cannot make any changes to the matrix due to invalid input parameters
            // (for example, needing a square matrix but receiving a non-square one as input)
            // Return these default values:
                // For value types (int, double, etc): 0
                // For reference types: null
                // If the task expects an array of results, return an empty array

            // If your denominator is 0 when calculating an average, consider it to be 0

            // If you end up 'cleaning' an array (or can't find suitable values), return an empty array

            // When moving or sorting elements, maintain their relative order
            // When dealing with jagged arrays, check the length of each row when accessing an element
            // When creating a new square matrix, read the elements row by row from left to right and fill the missing elements with zeros in the last row

            //===========================================================================================================================================================

            // code here
            // PROBLEM ONE----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается матрица (двумерный массив) matrix. Сформировать одномерный массив из количеств отрицательных элементов столбцов матрицы.

            // Create a one-dimensional array of the negative column elements of the two-dimensional array (i.e. a matrix) "matrix"

            //---------------------------------------------------------------------------------------------------------------------------------------------





            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

            return answer;
        }
        public void Task2(int[,] matrix)
        {

            // code here
            // PROBLEM TWO----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается матрица (двумерный массив) matrix.
            // В каждой строке матрицы минимальный элемент поместить в начало строки, сохранив порядок остальных элементов.
            // Если в строке несколько равных минимумов, выбирать первый(левый) и перемещать его в начало, остальные сохраняются в порядке.

            // In each row (строке) of the matrix, move the minimum element to the beginning of the row while preserving the order of the elements
            // If a row contains several (equal) minimum values, select the first one (the leftmost one) and move it to the beginning, while preserving order

            //------------------------------------------------------------------------------------------------------------------------------------------------



            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

        }
        public int[,] Task3(int[,] matrix)
        {
            int[,] answer = null;

            // code here
            // PROBLEM THREE----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается матрица (двумерный массив) matrix.
            // В каждой строке продублировать максимальный элемент, вставив новый элемент равный максимальному, сразу после максимального.
            // При нескольких максимумов брать первый(левый) максимум и вставлять новый элемент сразу после него (то есть сдвинуть последующие элементы вправо).

            // In each row, duplicate the maximum element by inserting a new element equal to the maximum inmediatly after it
            // If a row contains multiple maximum values, just work with the first one

            //---------------------------------------------------------------------------------------------------------------------------------------------------



            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

            return answer;
        }
        public void Task4(int[,] matrix)
        {

            // code here
            // PROBLEM FOUR----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается матрица (двумерный массив) matrix.
            // В каждой строке заменить все отрицательные элементы, расположенные перед первым (левым) максимальным элементом, на среднее арифметическое среди положительных элементов, расположенных после него.
            // Если после максимального нет положительных элементов, изменения не производить.
            // Для целочисленных матриц брать только целую часть среднего.

            // In each row, replace all negative elements that appear before the first maximum element, with the arithmetc mean of the positive elements located after that maximum
            // If there are no positive elements after the maximum, do not make any changes.
            // For integer matrices, use only the integer part of the mean

            //---------------------------------------------------------------------------------------------------------------------------------------------



            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

        }
        public void Task5(int[,] matrix, int k)
        {

            // code here
            // PROBLEM FIVE----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается матрица (двумерный массив) matrix и индекс столбца (column) k.
            // Заменить k-й столбец матрицы одномерным массивом, состоящим из максимальных элементов строк,
            // расположенных в обратном порядке (т.е 1 - й элемент k - го столбца – это максимальный элемент последней строки).

            // Replace the k-th column of the matrix with a one-dimensional array made up of the maximum element of the rows,
            // arranged in reverse order (i.e., the first element of the k-th column is the maximum element of the last row

            //---------------------------------------------------------------------------------------------------------------------------------------------



            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

        }
        public void Task6(int[,] matrix, int[] array)
        {

            // code here
            // PROBLEM SIX----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается матрица (двумерный массив) matrix и одномерный массив array.
            // Заменить первый (верхний) максимальный элемент столбца соответствующим ему элементом массива array,
            // если этот элемент больше найденного максимального элемента столбца.

            // Replace the first (topmost) maximum element of the column with the corresponding element of the array,
            // if that element is greater than the maximum element found in the column.

            //---------------------------------------------------------------------------------------------------------------------------------------------




            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

        }
        public void Task7(int[,] matrix)
        {

            // code here
            // PROBLEM SEVEN----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается матрица (двумерный массив) matrix.
            // Упорядочить строки по убыванию их минимальных элементов

            // Sort the rows in descending order according to their minimum elements

            //---------------------------------------------------------------------------------------------------------------------------------------------



            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

        }
        public int[] Task8(int[,] matrix)
        {
            int[] answer = null;

            // code here
            // PROBLEM EIGHT----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается квадратная матрица (двумерный массив) matrix.
            // Просуммировать элементы, расположенные на диагоналях, параллельных главной, включая главную диагональ.
            // Результат получить в виде массива размера 2n – 1, где n -размер стороны матрицы.
            // Заполнение массива элементами крайней (outermost/extreme) левой нижней диагонали с постепенным перемещением вправо вверх.

            // Sum the elements in each diagonal parallel to the main one, including the main diagonal itself
            // Return the result as an array of size "2n - 1", where n is the size of the matrix side
            // Fill the array with the elements of the leftmost bottom diagonal, moving gradually up and to the right

            //---------------------------------------------------------------------------------------------------------------------------------------------



            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

            return answer;
        }
        public void Task9(int[,] matrix, int k)
        {

            // code here
            // PROBLEM NINE----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается квадратная матрица (двумерный массив) matrix и индекс строки (и столбца) k.
            // Найти максимальный по модулю элемент матрицы.
            // Сдвинуть строки и столбцы так, чтобы строка и столбец, на пересечении которых находится найденный элемент,
            // оказались на пересечении k-й строки и k - го столбца.
            // При этом взаимный порядок остальных строк и столбцов должен сохраняться.

            // Find the element of the matrix with the largest absolute value.
            // Shift the rows and columns so that the row and column containing this element are moved to the k-th row and the k-th column.
            // The relative order of the remaining rows and columns must be preserved.

            //---------------------------------------------------------------------------------------------------------------------------------------------



            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

        }
        public int[,] Task10(int[,] A, int[,] B)
        {
            int[,] answer = null;

            // code here
            // PROBLEM TEN----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается две матрицы (двумерные массивы) A и B.
            // Перемножить матрицы и получить результат в новой матрице (двумерном массиве).

            // Multiply the matrices and store the result in a new matrix

            //---------------------------------------------------------------------------------------------------------------------------------------------



            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

            return answer;
        }
        public int[][] Task11(int[,] matrix)
        {
            int[][] answer = null;

            // code here
            // PROBLEM ELEVEN----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается матрица (двумерный массив) matrix.
            // Удалить в каждой строке неположительные элементы.
            // Получить результат в виде зубчатого массива.
            // Не изменять порядок оставшихся положительных элементов.
            // Если после удаления строка окажется пуста,включить пустую строку в выходной массив.

            // Remove all non-positive elements from each row.
            // Return the result as a jagged array (i.e., with rows of different lengths)
            // Do not change the order of the remaining positive elements.
            // If a row becomes empty after removal, include an empty row in the output array

            //---------------------------------------------------------------------------------------------------------------------------------------------



            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

            return answer;
        }
        public int[,] Task12(int[][] array)
        {
            int[,] answer = null;

            // code here
            // PROBLEM TWELVE----------------------------------------------------------------------------------------------------------------------------------------------------------------------------START

            // В метод передается зубчатый массив (массив массивов) array.
            // Из его элементов создать квадратную матрицу минимального размера, заполнив недостающие элементы нулями.
            // Заполнить элементы по строкам слева направо, сверху вниз, беря элементы из array в нисходящем порядке:
            // все элементы первой строки слева направо, потом второй строки и т.д.

            // Create a square matrix of the minimal size from its elements, filling any missing elements with zeros.
            // Fill the matrix row by rowm left to right, and top to bottom, taking elements from array in descending order:
            // All elements of the first row from left to right, then the second row, and so on, so forth.


            //---------------------------------------------------------------------------------------------------------------------------------------------


            //---------------------------------------------------------------------------------------------------------------------------------------------
            // end

            return answer;
        }
    }
}
